Estudando Series -  valores associados a valoreschave, parecido com o dicionário

In [5]:
import pandas as pd
import numpy as np

In [6]:
labels = ['a','b','c']

In [7]:
minha_lista = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10, 'b':20, 'c':30}

In [12]:
series = pd.Series(data=minha_lista,index=labels)

In [13]:
series['b']

20

In [15]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

Operações com Series

In [20]:
ser1 = pd.Series([1,2,3,4],index=['EUA','Alemanha','URSS','Japão'])

In [21]:
ser1

EUA         1
Alemanha    2
URSS        3
Japão       4
dtype: int64

In [22]:
ser2 = pd.Series([1,2,3,4],index=['EUA','Alemanha','Itália','Japão'])

In [23]:
ser2

EUA         1
Alemanha    2
Itália      3
Japão       4
dtype: int64

In [24]:
ser1+ser2

Alemanha    4.0
EUA         2.0
Itália      NaN
Japão       8.0
URSS        NaN
dtype: float64

DataFrame - Criação e fateamento

In [25]:
np.random.seed(101)

In [27]:
df = pd.DataFrame(np.random.randn(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

In [28]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [30]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [31]:
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [33]:
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [34]:
df['New']

KeyError: 'New'

In [35]:
df['New'] = df['W']+df['X']

In [37]:
df

          W         X         Y         Z       New
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
B -0.134841  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
E -0.116773  1.901755  0.238127  1.996652  1.784981

In [39]:
df.drop('New',axis=1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [40]:
df

          W         X         Y         Z       New
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
B -0.134841  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
E -0.116773  1.901755  0.238127  1.996652  1.784981

In [42]:
df.drop('New',axis=1,inplace = True)

In [43]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [44]:
df.loc['A','W']

0.3026654485851825

In [45]:
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [46]:
df.loc[['A','B'],['X','Y','Z']]

          X         Y         Z
A  1.693723 -1.706086 -1.159119
B  0.390528  0.166905  0.184502

In [51]:
df.iloc[:2,1:]

          X         Y         Z
A  1.693723 -1.706086 -1.159119
B  0.390528  0.166905  0.184502

In [52]:
df.iloc[1:4,2:]

          Y         Z
B  0.166905  0.184502
C  0.638787  0.329646
D -0.943406  0.484752

--Seleção Condicional de Dados

In [53]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [54]:
df>0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [55]:
bol = df>0

In [56]:
df[bol]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [57]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [59]:
df[df['W']>0]['Y']

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [68]:
bol=df['W']>0
df2 = df[bol]
df2['Y']

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [69]:
df[(df['W']>0)and(df['Y']>1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [76]:
df[(df['W']>0)&(df['Y']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [77]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [78]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [79]:
df.reset_index(inplace = True)

In [80]:
df

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [81]:
col = 'RS RJ SP AM SC'.split()

In [82]:
col

['RS', 'RJ', 'SP', 'AM', 'SC']

In [83]:
df['Estado'] = col

In [84]:
df

  index         W         X         Y         Z Estado
0     A  0.302665  1.693723 -1.706086 -1.159119     RS
1     B -0.134841  0.390528  0.166905  0.184502     RJ
2     C  0.807706  0.072960  0.638787  0.329646     SP
3     D -0.497104 -0.754070 -0.943406  0.484752     AM
4     E -0.116773  1.901755  0.238127  1.996652     SC

In [85]:
df.set_index('Estado')

       index         W         X         Y         Z
Estado
RS         A  0.302665  1.693723 -1.706086 -1.159119
RJ         B -0.134841  0.390528  0.166905  0.184502
SP         C  0.807706  0.072960  0.638787  0.329646
AM         D -0.497104 -0.754070 -0.943406  0.484752
SC         E -0.116773  1.901755  0.238127  1.996652

In [86]:
df

  index         W         X         Y         Z Estado
0     A  0.302665  1.693723 -1.706086 -1.159119     RS
1     B -0.134841  0.390528  0.166905  0.184502     RJ
2     C  0.807706  0.072960  0.638787  0.329646     SP
3     D -0.497104 -0.754070 -0.943406  0.484752     AM
4     E -0.116773  1.901755  0.238127  1.996652     SC

In [87]:
df.set_index('Estado', inplace=True)

In [88]:
df

       index         W         X         Y         Z
Estado
RS         A  0.302665  1.693723 -1.706086 -1.159119
RJ         B -0.134841  0.390528  0.166905  0.184502
SP         C  0.807706  0.072960  0.638787  0.329646
AM         D -0.497104 -0.754070 -0.943406  0.484752
SC         E -0.116773  1.901755  0.238127  1.996652

In [90]:
df.drop('index',axis =1, inplace = True)

In [91]:
df

               W         X         Y         Z
Estado
RS      0.302665  1.693723 -1.706086 -1.159119
RJ     -0.134841  0.390528  0.166905  0.184502
SP      0.807706  0.072960  0.638787  0.329646
AM     -0.497104 -0.754070 -0.943406  0.484752
SC     -0.116773  1.901755  0.238127  1.996652

In [94]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [95]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [96]:
inside

[1, 2, 3, 1, 2, 3]

In [97]:
hier_index = list(zip(outside, inside))

In [98]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [99]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [100]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [103]:
df = pd.DataFrame(np.random.randn(6,2),index = hier_index,columns = ['A','B'])

In [104]:
df

             A         B
G1 1  0.147027 -0.479448
   2  0.558769  1.024810
   3 -0.925874  1.862864
G2 1 -1.133817  0.610478
   2  0.386030  2.084019
   3 -0.376519  0.230336

In [105]:
df.loc['G1']

          A         B
1  0.147027 -0.479448
2  0.558769  1.024810
3 -0.925874  1.862864

In [106]:
df.loc['G1'].loc[1]

A    0.147027
B   -0.479448
Name: 1, dtype: float64

In [107]:
df.index.names

FrozenList([None, None])

In [108]:
df.index.names = (['Grupo','Numero'])

In [109]:
df

                     A         B
Grupo Numero
G1    1       0.147027 -0.479448
      2       0.558769  1.024810
      3      -0.925874  1.862864
G2    1      -1.133817  0.610478
      2       0.386030  2.084019
      3      -0.376519  0.230336

In [110]:
df.xs('G1')

               A         B
Numero
1       0.147027 -0.479448
2       0.558769  1.024810
3      -0.925874  1.862864

In [114]:
df

                     A         B
Grupo Numero
G1    1       0.147027 -0.479448
      2       0.558769  1.024810
      3      -0.925874  1.862864
G2    1      -1.133817  0.610478
      2       0.386030  2.084019
      3      -0.376519  0.230336

In [113]:
df.xs(1,level = 'Numero')

              A         B
Grupo
G1     0.147027 -0.479448
G2    -1.133817  0.610478

--Estudo de Dados Ausentes

In [115]:
d={'A':[1,2,np.nan],'B':[5,np.nan, np.nan],'C':[1,2,3]}

In [116]:
df = pd.DataFrame(d)

In [117]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [118]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [121]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [126]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [127]:
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [128]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [130]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [132]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [131]:
df.fillna(method ='ffill')

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

--Estudo usando Groupby

In [134]:
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
           'Nome':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
           'Venda':[200,120,340,124,243,350]}

In [135]:
df = pd.DataFrame(data)

In [136]:
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [137]:
group = df.groupby('Empresa')

In [138]:
group

In [139]:
group.sum()

         Venda
Empresa
FB         593
GOOG       320
MSFT       464

In [140]:
group.mean()

         Venda
Empresa
FB       296.5
GOOG     160.0
MSFT     232.0

In [141]:
group.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [142]:
group = df.groupby('Nome')

In [143]:
group

In [145]:
group.sum()

         Venda
Nome
Amy        340
Carl       243
Charlie    120
Sam        200
Sarah      350
Vanessa    124

In [146]:
group.sum().loc['Amy']

Venda    340
Name: Amy, dtype: int64